# Напишіть программу "Касир в кінотеватрі", яка попросить користувача ввести свій вік (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
#
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
#
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
#
# якщо від 16 до 65 то зробіть якесь вітальне повідомлення,
#на ваш розсуд.якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"
#
# age = int(input('age?'))
#
# if age < 7:
#     print('Де твої батьки?')
# elif age < 16:
#     print('Це фільм для дорослих')
# elif 65>age>=16:
#     print('hi')
# elif age>65:
#     print('пенсионное')
#
# Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт, а можуть бути в стр). Потім запитує
# це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат перемножений на три. якщо
# після конкатенації отримали 10 то перемноживши на 3 отримаємо 30.
#
num1 = input('первое число')
num2 = input('первое число')
data_type = input('str or int?')

if data_type == 'int':
    print((int(num1)+ int(num2)) *3)
else:
    print((str(num1) + str(num2)) * 3)

